In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
#mapping - adding columns to dataframes
dFrame = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                    'altitude':[3158,3000,2762]})

dFrame

         city  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2762

In [4]:
#add a column to dataframe for each state - you can use mapping - create dictionary
state_map = {'Alma':'Colorado', 'Brian Head':'Utah', 'Fox Park':'Wyoming'}

In [5]:
#.map to add dictionary to dataframe
dFrame['state'] = dFrame['city'].map(state_map)

In [6]:
dFrame

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming